{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 128], "bias_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3"}