{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 128], "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "bias_regularizer": null}}]}