{"config": [{"config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 3, 1], "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 64, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 64, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 5, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "name": "dense_3", "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow"}