{"keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "units": 128, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 10]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "units": 128, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "units": 6, "name": "dense_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null}}], "backend": "tensorflow"}