{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 128], "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "use_bias": true, "name": "dense_2", "kernel_constraint": null, "units": 128, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "use_bias": true, "name": "dense_3", "kernel_constraint": null, "units": 6, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}], "keras_version": "2.1.3"}